# **PANDAS**
***************************************

Pandas is a Python library used for working with structured data (like tables, CSVs, Excel sheets).

## Working with DataFrames

In [3]:
import pandas as pd

In [4]:
s = pd.Series([10,20,30,40]) # Series represents a one dimensional labeled array 
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
s = pd.Series([100,200,300], index = ['A','B','C']) # Renaming the indexes
print(s)
print(s['B'])

A    100
B    200
C    300
dtype: int64
200

In [6]:
data = {'Name':['Arya','Ravi','Meera'], # Converting dictionary data into a table
        'Marks':[85,92,78],
        'City':['Pune','Delhi','Mumbai']}
df = pd.DataFrame(data)
df

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

In [7]:
df1 = df.copy() # Creates a copy of the table 'df' into 'df1'
df1['Grades']=(['A','A+','B'])
df1

    Name  Marks    City Grades
0   Arya     85    Pune      A
1   Ravi     92   Delhi     A+
2  Meera     78  Mumbai      B

In [8]:
print(df)
print()
print(df1)

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

    Name  Marks    City Grades
0   Arya     85    Pune      A
1   Ravi     92   Delhi     A+
2  Meera     78  Mumbai      B

In [9]:
del df1['Grades']
print(df1)

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

In [10]:
print(df)
print()
print(df1)

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

In [11]:
df.loc[1] # Access the record at the particular index location using 'loc'

Name      Ravi
Marks       92
City     Delhi
Name: 1, dtype: object

In [12]:
df.iloc[0:2] # Iterates over the specified range & prints it

   Name  Marks   City
0  Arya     85   Pune
1  Ravi     92  Delhi

In [13]:
df[['Name','City']] # Accessing particular columns

    Name    City
0   Arya    Pune
1   Ravi   Delhi
2  Meera  Mumbai

In [14]:
print(df.loc[1])

Name      Ravi
Marks       92
City     Delhi
Name: 1, dtype: object

In [15]:
df.loc[0:2]

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

In [16]:
df.rename(columns = {'Marks':'Score'}, inplace = True) # Renames the column
df

    Name  Score    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

## Working with Excel Tables (csv's)

#### Load the dataset

In [67]:
df = pd.read_csv("recharge.csv")

#### Basic Operations

In [68]:
print(df.head()) #shows first 5 rows

   user_id  amount recharge_type        date   status     plan_name Region
0      101      23       prepaid  01-01-2025  success     Data Pack   East
1      102      26      postpaid  02-01-2025  success  Monthly Plan   West
2      103      99       prepaid  03-01-2025   failed           NaN  Delhi
3      105     499           NaN  04-01-2025  success   Super Saver   East
4      105     149       prepaid  05-01-2025  success     Data Pack  North

In [69]:
print(df.to_string()) # displays all records

    user_id  amount recharge_type        date   status     plan_name Region
0       101      23       prepaid  01-01-2025  success     Data Pack   East
1       102      26      postpaid  02-01-2025  success  Monthly Plan   West
2       103      99       prepaid  03-01-2025   failed           NaN  Delhi
3       105     499           NaN  04-01-2025  success   Super Saver   East
4       105     149       prepaid  05-01-2025  success     Data Pack  North
5       106     249      postpaid  06-01-2025  success  Monthly Plan  Delhi
6       106     249      postpaid  06-01-2025  success  Monthly Plan  North
7       107      50       prepaid  07-01-2025      NaN      SMS Pack   East
8       108     399      postpaid  08-01-2025  success   Annual Lite  North
9       109     129           NaN         NaN  success      TalkTime  Delhi
10      110     299      postpaid  10-01-2025  success           NaN  South
11      111      26       prepaid  11-01-2025      NaN     Data Pack  North
12      112     599      postpaid  12-01-2025  success  Premium Plan   West
13      113      79       prepaid  13-01-2025   failed      SMS Pack   East
14      114     199      postpaid         NaN  success           NaN  North
15      115     259       prepaid  15-01-2025  success     Data Pack   West

#### View Data Information

In [70]:
df.shape # (rows, columns)

(16, 7)

In [71]:
df.columns # Column names

Index(['user_id', 'amount', 'recharge_type', 'date', 'status', 'plan_name',
       'Region'],
      dtype='object')

In [72]:
df.info() # Data types and nulls

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   user_id        16 non-null     int64
 1   amount         16 non-null     int64
 2   recharge_type  14 non-null     object
 3   date           14 non-null     object
 4   status         14 non-null     object
 5   plan_name      13 non-null     object
 6   Region         16 non-null     object
dtypes: int64(2), object(5)
memory usage: 1.0+ KB

In [73]:
df.describe() #Summary stats

          user_id      amount
count   16.000000   16.000000
mean   107.937500  208.312500
std      4.296801  173.598663
min    101.000000   23.000000
25%    105.000000   71.750000
50%    107.500000  174.000000
75%    111.250000  269.000000
max    115.000000  599.000000

#### Select Columns and Rows

In [74]:
df[['Region']] # Single column

   Region
0    East
1    West
2   Delhi
3    East
4   North
5   Delhi
6   North
7    East
8   North
9   Delhi
10  South
11  North
12   West
13   East
14  North
15   West

In [75]:
df[['Region','amount']] # Multiple column

   Region  amount
0    East      23
1    West      26
2   Delhi      99
3    East     499
4   North     149
5   Delhi     249
6   North     249
7    East      50
8   North     399
9   Delhi     129
10  South     299
11  North      26
12   West     599
13   East      79
14  North     199
15   West     259

In [76]:
df.loc[0] # Row by index

user_id                 101
amount                   23
recharge_type       prepaid
date             01-01-2025
status              success
plan_name         Data Pack
Region                 East
Name: 0, dtype: object

In [77]:
df.iloc[0:3] # First 3 rows

   user_id  amount recharge_type        date   status     plan_name Region
0      101      23       prepaid  01-01-2025  success     Data Pack   East
1      102      26      postpaid  02-01-2025  success  Monthly Plan   West
2      103      99       prepaid  03-01-2025   failed           NaN  Delhi

#### Basic Calculations

In [78]:
df['amount'].sum()

np.int64(3333)

In [79]:
df['amount'].mean()

np.float64(208.3125)

In [80]:
df['amount'].max()

599

In [81]:
df['plan_name'].value_counts()

plan_name
Data Pack       4
Monthly Plan    3
SMS Pack        2
Super Saver     1
Annual Lite     1
TalkTime        1
Premium Plan    1
Name: count, dtype: int64

#### Group and Aggregate

In [82]:
df.groupby('Region')['amount'].sum()

Region
Delhi     477
East      651
North    1022
South     299
West      884
Name: amount, dtype: int64

In [83]:
df.groupby(['Region', 'plan_name'])['amount'].mean()

Region  plan_name
Delhi   Monthly Plan    249.0
        TalkTime        129.0
East    Data Pack        23.0
        SMS Pack         64.5
        Super Saver     499.0
North   Annual Lite     399.0
        Data Pack        87.5
        Monthly Plan    249.0
West    Data Pack       259.0
        Monthly Plan     26.0
        Premium Plan    599.0
Name: amount, dtype: float64

### *Data Cleaning and Analysis*

### Handle Missing Values

In [84]:
df.isnull().sum() # Counts missing in each column

user_id          0
amount           0
recharge_type    2
date             2
status           2
plan_name        3
Region           0
dtype: int64

In [85]:
df.dropna() # Drops rows with missing values

    user_id  amount recharge_type        date   status     plan_name Region
0       101      23       prepaid  01-01-2025  success     Data Pack   East
1       102      26      postpaid  02-01-2025  success  Monthly Plan   West
4       105     149       prepaid  05-01-2025  success     Data Pack  North
5       106     249      postpaid  06-01-2025  success  Monthly Plan  Delhi
6       106     249      postpaid  06-01-2025  success  Monthly Plan  North
8       108     399      postpaid  08-01-2025  success   Annual Lite  North
12      112     599      postpaid  12-01-2025  success  Premium Plan   West
13      113      79       prepaid  13-01-2025   failed      SMS Pack   East
15      115     259       prepaid  15-01-2025  success     Data Pack   West

In [86]:
df.fillna(0) # Replace the missing values with 0

    user_id  amount recharge_type        date   status     plan_name Region
0       101      23       prepaid  01-01-2025  success     Data Pack   East
1       102      26      postpaid  02-01-2025  success  Monthly Plan   West
2       103      99       prepaid  03-01-2025   failed             0  Delhi
3       105     499             0  04-01-2025  success   Super Saver   East
4       105     149       prepaid  05-01-2025  success     Data Pack  North
5       106     249      postpaid  06-01-2025  success  Monthly Plan  Delhi
6       106     249      postpaid  06-01-2025  success  Monthly Plan  North
7       107      50       prepaid  07-01-2025        0      SMS Pack   East
8       108     399      postpaid  08-01-2025  success   Annual Lite  North
9       109     129             0           0  success      TalkTime  Delhi
10      110     299      postpaid  10-01-2025  success             0  South
11      111      26       prepaid  11-01-2025        0     Data Pack  North
12      112     599      postpaid  12-01-2025  success  Premium Plan   West
13      113      79       prepaid  13-01-2025   failed      SMS Pack   East
14      114     199      postpaid           0  success             0  North
15      115     259       prepaid  15-01-2025  success     Data Pack   West

#### Rename Columns

In [87]:
df.rename(columns={'amount':'Recharge_Amount'}, inplace = True)
df

,user_id,Recharge_Amount,recharge_type,date,status,plan_name,Region
0,101,23,prepaid,01-01-2025,success,Data Pack,East
1,102,26,postpaid,02-01-2025,success,Monthly Plan,West
2,103,99,prepaid,03-01-2025,failed,NaN,Delhi
3,105,499,NaN,04-01-2025,success,Super Saver,East
4,105,149,prepaid,05-01-2025,success,Data Pack,North
5,106,249,postpaid,06-01-2025,success,Monthly Plan,Delhi
6,106,249,postpaid,06-01-2025,success,Monthly Plan,North
7,107,50,prepaid,07-01-2025,NaN,SMS Pack,East
8,108,399,postpaid,08-01-2025,success,Annual Lite,North
9,109,129,NaN,NaN,success,TalkTime,Delhi
10,110,299,postpaid,10-01-2025,success,NaN,South
11,111,26,prepaid,11-01-2025,NaN,Data Pack,North
12,112,599,postpaid,12-01-2025,success,Premium Plan,West
13,113,79,prepaid,13-01-2025,failed,SMS Pack,East
14,114,199,postpaid,NaN,success,NaN,North
15,115,259,prepaid,15-01-2025,success,Data Pack,West

#### Filter Rows

In [88]:
df[df['Recharge_Amount'] > 300] # High-value recharges

,user_id,Recharge_Amount,recharge_type,date,status,plan_name,Region
3,105,499,NaN,04-01-2025,success,Super Saver,East
8,108,399,postpaid,08-01-2025,success,Annual Lite,North
12,112,599,postpaid,12-01-2025,success,Premium Plan,West

#### Create New Columns

In [89]:
df['Bonus'] = df['Recharge_Amount'] * 0.10
df

,user_id,Recharge_Amount,recharge_type,date,status,plan_name,Region,Bonus
0,101,23,prepaid,01-01-2025,success,Data Pack,East,2.3
1,102,26,postpaid,02-01-2025,success,Monthly Plan,West,2.6
2,103,99,prepaid,03-01-2025,failed,NaN,Delhi,9.9
3,105,499,NaN,04-01-2025,success,Super Saver,East,49.9
4,105,149,prepaid,05-01-2025,success,Data Pack,North,14.9
5,106,249,postpaid,06-01-2025,success,Monthly Plan,Delhi,24.9
6,106,249,postpaid,06-01-2025,success,Monthly Plan,North,24.9
7,107,50,prepaid,07-01-2025,NaN,SMS Pack,East,5.0
8,108,399,postpaid,08-01-2025,success,Annual Lite,North,39.9
9,109,129,NaN,NaN,success,TalkTime,Delhi,12.9
10,110,299,postpaid,10-01-2025,success,NaN,South,29.9
11,111,26,prepaid,11-01-2025,NaN,Data Pack,North,2.6
12,112,599,postpaid,12-01-2025,success,Premium Plan,West,59.9
13,113,79,prepaid,13-01-2025,failed,SMS Pack,East,7.9
14,114,199,postpaid,NaN,success,NaN,North,19.9
15,115,259,prepaid,15-01-2025,success,Data Pack,West,25.9

In [90]:
df['Recharge_Flag'] = df['Recharge_Amount'] > 299
df

,user_id,Recharge_Amount,recharge_type,date,status,plan_name,Region,Bonus,Recharge_Flag
0,101,23,prepaid,01-01-2025,success,Data Pack,East,2.3,False
1,102,26,postpaid,02-01-2025,success,Monthly Plan,West,2.6,False
2,103,99,prepaid,03-01-2025,failed,NaN,Delhi,9.9,False
3,105,499,NaN,04-01-2025,success,Super Saver,East,49.9,True
4,105,149,prepaid,05-01-2025,success,Data Pack,North,14.9,False
5,106,249,postpaid,06-01-2025,success,Monthly Plan,Delhi,24.9,False
6,106,249,postpaid,06-01-2025,success,Monthly Plan,North,24.9,False
7,107,50,prepaid,07-01-2025,NaN,SMS Pack,East,5.0,False
8,108,399,postpaid,08-01-2025,success,Annual Lite,North,39.9,True
9,109,129,NaN,NaN,success,TalkTime,Delhi,12.9,False
10,110,299,postpaid,10-01-2025,success,NaN,South,29.9,False
11,111,26,prepaid,11-01-2025,NaN,Data Pack,North,2.6,False
12,112,599,postpaid,12-01-2025,success,Premium Plan,West,59.9,True
13,113,79,prepaid,13-01-2025,failed,SMS Pack,East,7.9,False
14,114,199,postpaid,NaN,success,NaN,North,19.9,False
15,115,259,prepaid,15-01-2025,success,Data Pack,West,25.9,False

#### Sort Data

In [91]:
df.sort_values('Recharge_Amount',ascending = False)

,user_id,Recharge_Amount,recharge_type,date,status,plan_name,Region,Bonus,Recharge_Flag
12,112,599,postpaid,12-01-2025,success,Premium Plan,West,59.9,True
3,105,499,NaN,04-01-2025,success,Super Saver,East,49.9,True
8,108,399,postpaid,08-01-2025,success,Annual Lite,North,39.9,True
10,110,299,postpaid,10-01-2025,success,NaN,South,29.9,False
15,115,259,prepaid,15-01-2025,success,Data Pack,West,25.9,False
5,106,249,postpaid,06-01-2025,success,Monthly Plan,Delhi,24.9,False
6,106,249,postpaid,06-01-2025,success,Monthly Plan,North,24.9,False
14,114,199,postpaid,NaN,success,NaN,North,19.9,False
4,105,149,prepaid,05-01-2025,success,Data Pack,North,14.9,False
9,109,129,NaN,NaN,success,TalkTime,Delhi,12.9,False
2,103,99,prepaid,03-01-2025,failed,NaN,Delhi,9.9,False
13,113,79,prepaid,13-01-2025,failed,SMS Pack,East,7.9,False
7,107,50,prepaid,07-01-2025,NaN,SMS Pack,East,5.0,False
1,102,26,postpaid,02-01-2025,success,Monthly Plan,West,2.6,False
11,111,26,prepaid,11-01-2025,NaN,Data Pack,North,2.6,False
0,101,23,prepaid,01-01-2025,success,Data Pack,East,2.3,False

#### Export Cleaned Data

In [93]:
df.to_csv("cleaned_recharge_data.csv", index = False)